{
  "project": "Scanva",
  "branchName": "ralph/git-diff-rule-validation",
  "description": "Git Diff Rule Validation - Check rule pattern matches against git diff changes and track violations",
  "userStories": [
    {
      "id": "US-001",
      "title": "Create DiffProcessor service",
      "description": "As a developer, I need a service to analyze git diffs and check for pattern matches so it can be integrated into the rule processing pipeline.",
      "acceptanceCriteria": [
        "Create src/services/DiffProcessor.ts with class DiffProcessor",
        "Implement method getDiffContent(): string to retrieve git diff using spawnSync (consistent with git.ts pattern)",
        "Implement method hasPatternInDiff(pattern: string | RegExp | string[], diffContent: string): boolean",
        "Use spawnSync from node:child_process (already used in helpers/git.ts)",
        "Handle missing .git directory gracefully (return empty string or warn)",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Extend RuleResult to include flagged files",
      "description": "As a developer, I need to store which files violated rules and their error levels so violations can be tracked.",
      "acceptanceCriteria": [
        "Add FlaggedFile interface with properties: file: string, rule: Rule, errorLevel: string",
        "Extend RuleResult interface to include flaggedFiles: FlaggedFile[]",
        "Update RuleResult initialization in RuleProcessor",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Integrate DiffProcessor into RuleProcessor",
      "description": "As a system, I need to check matched files against git diff changes so rule violations are detected automatically.",
      "acceptanceCriteria": [
        "Instantiate DiffProcessor in RuleProcessor",
        "Cache diff content once retrieved and reuse across all rule checks",
        "After finding files matching rule pattern, check if pattern exists in diff",
        "For files with matches in diff, add to flaggedFiles with rule and errorLevel",
        "Log flagged violations with file and error level",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Handle edge cases in diff validation",
      "description": "As a system, I need to handle various scenarios gracefully so processing doesn't fail unexpectedly.",
      "acceptanceCriteria": [
        "If no .git directory exists, skip diff validation (log warning, continue normally)",
        "If diff retrieval fails, catch error and log warning (don't crash)",
        "If pattern is RegExp, test against diff lines",
        "If pattern is array, check if any pattern exists in diff",
        "If pattern is string, check if string exists in diff",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-005",
      "title": "Output flagged files list",
      "description": "As a user, I want to see which files violated rules in the recent commit so I can understand what needs fixing.",
      "acceptanceCriteria": [
        "Summary output shows total flagged files count per error level",
        "Each flagged file shows: filename, rule name, error level, matched pattern",
        "Sorted by error level (error > warn > info) then by filename",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": false,
      "notes": ""
    }
  ]
}
